No3x3x3/LEDBrain/esp32c6_firmware/sdkconfig.defaults
# ESP32-C6 WiFi Coprocessor Firmware Default Configuration
# Target: ESP32-C6
# Purpose: WiFi gateway for ESP32-P4 via PPP over UART

# Target configuration
CONFIG_IDF_TARGET="esp32c6"

# WiFi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_AMSDU_TX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y

# PPP over UART
CONFIG_EPPP_LINK_USES_PPP=y
CONFIG_EPPP_LINK_DEVICE_UART=y
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_PPP_PAP_SUPPORT=y
CONFIG_LWIP_PPP_CHAP_SUPPORT=y
CONFIG_LWIP_PPP_MSCHAP_SUPPORT=y
CONFIG_LWIP_PPP_MPPE_SUPPORT=y

# NAPT (Network Address Port Translation) for Internet sharing
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Bootloader
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y

# NVS
CONFIG_NVS_ENCRYPTION=n

